Revit 2026 API

# LabelUtilsGetLabelFor(BuiltInCategory) Method

---

Gets the user-visible name for a BuiltInCategory.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GetLabelFor(
	BuiltInCategory builtInCategory
)
```
```vb
Public Shared Function GetLabelFor (
	builtInCategory As BuiltInCategory
) As String
```
```cpp
public:
static String^ GetLabelFor(
	BuiltInCategory builtInCategory
)
```
```fsharp
static member GetLabelFor :
        builtInCategory : BuiltInCategory -> string
```

#### Parameters

builtInCategory BuiltInCategory
     The BuiltInCategory to get the user-visible name.

#### Return Value

String

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the builtin category is not valid. |

The name is obtained in the current Revit language.

#### Reference

LabelUtils Class

GetLabelFor Overload

Autodesk.Revit.DB Namespace